In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

In [3]:
df=sns.load_dataset("titanic")

In [5]:
df.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [6]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [8]:
df=df.drop(columns=['survived','pclass','sex','sibsp','parch','fare','class','who','adult_male','alive'])

In [10]:
df=df.drop(columns=['alone'])

In [56]:
df.head(2)

    age embarked deck  embark_town
0  22.0        S  NaN  Southampton
1  38.0        C    C    Cherbourg

In [57]:
from sklearn.impute import SimpleImputer

In [58]:
sm=SimpleImputer(strategy='mean')

In [59]:
sf=SimpleImputer(strategy='most_frequent')

In [60]:
df[['age']]=sm.fit_transform(df[['age']])

In [61]:
df[['embarked']]=sf.fit_transform(df[['embarked']])

In [63]:
df[['deck']]=sf.fit_transform(df[['deck']])

In [65]:
df[['embark_town']]=sf.fit_transform(df[['embark_town']])

In [67]:
df.isnull().sum()

age            0
embarked       0
deck           0
embark_town    0
dtype: int64

In [71]:
df

           age embarked deck  embark_town
0    22.000000        S    C  Southampton
1    38.000000        C    C    Cherbourg
2    26.000000        S    C  Southampton
3    35.000000        S    C  Southampton
4    35.000000        S    C  Southampton
..         ...      ...  ...          ...
886  27.000000        S    C  Southampton
887  19.000000        S    B  Southampton
888  29.699118        S    C  Southampton
889  26.000000        C    C    Cherbourg
890  32.000000        Q    C   Queenstown

[891 rows x 4 columns]

# 2nd Data

In [72]:
import numpy as n
import pandas as p

In [73]:
df=p.read_csv("F:\\REGex\\MachineLearning\\titanic.csv")

In [74]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

In [75]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [76]:
from sklearn.impute import SimpleImputer

In [77]:
smean=SimpleImputer(strategy='mean')

In [88]:
sfreq=SimpleImputer(strategy='most_frequent')

In [89]:
df[['Age']]=smean.fit_transform(df[['Age']])

In [90]:
df[['Fare']]=smean.fit_transform(df[['Fare']])

In [92]:
df[['Cabin']]=sfreq.fit_transform(df[['Cabin']])

In [94]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64